Repository: egedursun/bimod-lab
Catalog: locale/*/LC_MESSAGES/django.po
Languages: tr

source: Build your AI workforce with the most flexible multimodal agent platform.
tr: En Esnek Çoklu Modlu Ajan Platformu ile AI iş gücünüzü oluşturun.

source: We are empowering businesses by providing a highly customizable and flexible
tr: Çoklu modlu AI asistanlarını yönetmek için son derece özelleştirilebilir ve esnek bir AIaaS (Yapay Zeka Hizmeti) platformu sağlayarak işletmeleri güçlendiriyoruz. Her ölçekte iş akışlarını otomatikleştirmek için yüzlerce farklı çoklu modluluk aracını ve özel entegrasyonları kullanın.

source: FREE CREDITS
tr: BAKİYE HEDİYE

source: TRY NOW
tr: ÜCRETSİZ DENEYİN

source: Services
tr: Hizmetler

source: Everything you need to build
tr: İşletmeniz için en güçlü yapay zekaları

source: the most powerful AIs for your organization.
tr: oluşturmak için ihtiyacınız olan her şey.

source: We offer a wide range of features to help you build and manage AI assistants with ease.
tr: AI asistanlarınızı kolayca oluşturmanıza ve yönetmenize yardımcı olacak geniş bir özellik yelpazesi sunuyoruz.

source: All in One Service You Need
tr: İhtiyacınız Olan Tüm Hizmetler

source: Access all the tools you need to build and manage AI assistants in one place.
tr: AI asistanlarınızı oluşturmak ve yönetmek için ihtiyacınız olan tüm araçlara tek bir yerden erişin.

source: Tenants, Users, Permissions
tr: Alt Müşteriler, Kullanıcılar, İzinler

source: Easily manage multiple organizations and AI assistants from a single dashboard.
tr: Tek bir panelden birden fazla organizasyonu ve AI asistanlarını kolayca yönetin.

source: Fully Customizable LLM Models
tr: Tamamen Özelleştirilebilir LLM Modelleri

source: Customize LLM models depending on your organization's needs.
tr: Organizasyonunuzun ihtiyaçlarına bağlı olarak LLM modellerini özelleştirin.

source: Unlimited Assistant Flexibility
tr: Sınırsız Asistan Esnekliği

source: Create multiple AI assistants that can handle a wide range of tasks and workflows.
tr: Geniş bir yelpazede görev ve iş akışlarını yönetebilen birden fazla AI asistanı oluşturun.

source: Make Assistants Remember
tr: Asistanların Hatırlamasını Sağlayın

source: Add a memory to your AI assistants, so they can remember important points and information.
tr: AI asistanlarınıza bir hafıza ekleyerek önemli noktaları ve bilgileri hatırlamalarını sağlayın.

source: Create An AI Workforce
tr: AI İş Gücü Oluşturun

source: Build a workforce of AI assistants that can handle a wide range of tasks and workflows and collaborate with each other.
tr: Birbirleriyle işbirliği yapabilen geniş bir yelpazede görev ve iş akışlarını yönetebilen AI asistanlarından oluşan bir iş gücü oluşturun.

source: Connect Your Databases
tr: Veritabanlarınızı Bağlayın

source: Connect your database to your AI assistants to make them reach your data and provide more accurate responses.
tr: AI asistanlarınızın verilerinize ulaşmasını ve daha doğru yanıtlar vermesini sağlamak için veritabanınızı AI asistanlarınıza bağlayın.

source: Chat with Your Documents & Files
tr: Belgeleriniz ve Dosyalarınızla Sohbet Edin

source: Upload documents, files, images, audios, videos and much more to your AI assistants and let them do the chores for you.
tr: Belgelerinizi, dosyalarınızı, resimleri, sesleri, videoları ve çok daha fazlasını AI asistanlarınıza yükleyin ve onları sizin için işleri halletmeye bırakın.

source: Functions, APIs, Kernels, Scripts
tr: Fonksiyonlar, API'lar, Sunucular, Betikler

source: Make AI use functions, APIs, and remote servers via SSH to provide real-time information and automate your workflows.
tr: AI'nın gerçek zamanlı bilgi sağlaması ve iş akışlarınızı otomatikleştirmesi için fonksiyonlar, API'lar ve SSH üzerinden uzak sunucuları kullanmasını sağlayın.

source: Scheduled Tasks & Custom Triggers
tr: Zamanlanmış Görevler ve Özel Tetikleyiciler

source: Schedule timed tasks and custom triggers for your AI assistants to provide you service 24/7 without any human intervention.
tr: AI asistanlarınız için zamanlanmış görevler ve özel tetikleyiciler oluşturarak insan müdahalesi olmadan size 7/24 hizmet sunmalarını sağlayın.

source: Generate Creative Media Materials
tr: Yaratıcı Medya İçerikleri Oluşturun

source: Generate images, presentations, documents, and much more with your assistants within seconds.
tr: Asistanlarınızla saniyeler içinde resimler, sunumlar, belgeler ve çok daha fazlasını oluşturun.

source: Tailor-made, Custom Integrations
tr: Size özel Biçimlendirilmiş Entegrasyonlar

source: With a single click, integrate tools and assistants you need for your organization and manage them easily with a simple UI.
tr: Organizasyonunuz için ihtiyacınız olan araçları ve asistanları tek bir tıklamayla entegre edin ve bunları basit bir kullanıcı arayüzüyle kolayca yönetin.

source: Our Team
tr: Ekibimiz

source: Supported
tr: Tutku ve azimden

source: by passion and perseverance.
tr: güç alan bir ekip.

source: Meet the dedicated team behind
tr: Br6.in'in arkasındaki özverili ekibi tanıyın.

source: Co-Founder & Chief Executive Officer (CEO)
tr: Kurucu & Başkan

source: Co-Founder & Chief Operating Officer (COO)
tr: Kurucu & Operasyon Müdürü

source: Chief Technology Officer (CTO) & AI Engineer
tr: Teknoloji Müdürü & AI Mühendisi

source: Chief Marketing Officer (CTO) & Legal Expert
tr: Pazarlama Müdürü & Hukuk Uzmanı

source: Chief Finance Officer (CFO) & Solutions Architect
tr: Mali İşler Müdürü & İşletme Çözümleri Mimarı

source: Pricing Plans
tr: Fiyatlandırma

source: Never pay
tr: Hiçbir zaman

source: for more than you need.
tr: ihtiyacınızdan fazlası için ödeme yapmayın.

source: Our flexible pay as you go pricing plans are designed to fit your organization's needs. Top-up balance any time and pay only for what you use
tr: Esnek ödeme yaparak ödeme planlarımız, organizasyonunuzun ihtiyaçlarına uygun olarak tasarlanmıştır. Her zaman bakiyenizi doldurun ve sadece kullandığınız miktarı ödeyin.

source: Starter
tr: Başlangıç

source: Grower
tr: Kobi

source: Professional
tr: Profesyonel

source: Enterprise
tr: Kurumsal

source: Purchase
tr: Hacim

source: Receive
tr: Fazladan

source: more credits
tr: kredi hediye

source: Ready to Get Started?
tr: Başlamaya Hazır Mısınız?

source: Start and receive your first
tr: Başlayın ve ilk

source: credits for free.
tr: kredinizi ücretsiz alın.

source: Join Our Community Now
tr: Şimdi Topluluğumuza Katılın

source: Contact
tr: İletişim

source: Let's collaborate together
tr: Size özel ihtiyaçlarınız için

source: for your custom needs.
tr: birlikte çalışalım.

source: Do you have any questions or need help with your AI assistant? Feel free to contact us, and we would be happy to help you as soon as possible.
tr: Herhangi bir sorunuz var mı veya AI asistanınızla ilgili yardıma mı ihtiyacınız var? Bize ulaşmaktan çekinmeyin; size en kısa sürede yardımcı olmaktan mutluluk duyarız.

source: Contact E-mail
tr: İletişim E-postası

source: Contact Number
tr: İletişim Numarası

source: Leave a Message
tr: Mesaj Bırakın

source: If you would like to discuss anything related to payment, account, licensing,
tr: Ödeme, hesap, lisanslama ile ilgili herhangi bir konuyu tartışmak isterseniz,

source: partnerships, or have any questions regarding the application or its features,
tr: veya ortaklıklar veya uygulama veya özellikleri hakkında herhangi bir sorunuz varsa,

source: please fill out the form below.
tr: lütfen aşağıdaki formu doldurarak bize ulaşın.

source: Customer Username
tr: Müşteri Kullanıcı Adı

source: You can leave this field blank if you are currently not an active customer.
tr: Şu anda aktif bir müşteri değilseniz bu alanı boş bırakabilirsiniz.

source: Full Name
tr: Adınız ve Soyadınız

source: Your Email
tr: E-posta Adresiniz

source: Your Message
tr: Mesajınız

source: Send Inquiry
tr: Mesajı Gönder
